In [7]:
import pandas as pd

In [8]:
Data Analysis
1. Description
2. Diagnosis
3. Prediction
4. Action/prescription

SyntaxError: invalid syntax (3453781735.py, line 1)

In [14]:
item_cols = ['movie_id','title']+ [str(i) for i in range(22)]

In [15]:
#read the other file
df1 = pd.read_csv('u.item',sep='|', names = item_cols, encoding = "ISO-8859-1") [['movie_id','title']]

In [16]:
#Read the files
df = pd.read_csv('u.data',sep='\t',names=cols)

In [17]:
# The column names
cols = ['user_id','movie_id','rating','ts']

In [18]:
df1.shape

(1682, 2)

# Exploratory Data Analysis

In [89]:
df.head()

   user_id  movie_id  rating         ts
0        0        50       5  881250949
1        0       172       5  881250949
2        0       133       1  881250949
3      196       242       3  881250949
4      186       302       3  891717742

In [90]:
df1.sample(3)

      movie_id                         title
1183      1184  Endless Summer 2, The (1994)
50          51    Legends of the Fall (1994)
631        632        Sophie's Choice (1982)

In [91]:
df1.sample(5)

     movie_id                                   title
524       525                   Big Sleep, The (1946)
881       882                Washington Square (1997)
547       548       NeverEnding Story III, The (1994)
435       436  American Werewolf in London, An (1981)
41         42                           Clerks (1994)

In [92]:
df.sample(5)

       user_id  movie_id  rating         ts
72173      452      1057       1  876215627
23403      303       808       2  879484480
79817      624       329       3  891961120
4364       222       501       2  881060331
33900      276       189       4  874977555

In [93]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100003 entries, 0 to 100002
Data columns (total 4 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   user_id   100003 non-null  int64
 1   movie_id  100003 non-null  int64
 2   rating    100003 non-null  int64
 3   ts        100003 non-null  int64
dtypes: int64(4)
memory usage: 3.1 MB

In [94]:
df.describe(include='all')

             user_id       movie_id         rating            ts
count  100003.000000  100003.000000  100003.000000  1.000030e+05
mean      462.470876     425.520914       3.529864  8.835288e+08
std       266.622454     330.797791       1.125704  5.343791e+06
min         0.000000       1.000000       1.000000  8.747247e+08
25%       254.000000     175.000000       3.000000  8.794487e+08
50%       447.000000     322.000000       4.000000  8.828269e+08
75%       682.000000     631.000000       4.000000  8.882600e+08
max       943.000000    1682.000000       5.000000  8.932866e+08

In [95]:
#string data categorical info , random stuff
#numerical data quantanized , categorical 
#random numbers or to sort of data

In [96]:
df.columns

Index(['user_id', 'movie_id', 'rating', 'ts'], dtype='object')

In [97]:
df['rating'].unique()

array([5, 1, 3, 2, 4], dtype=int64)

In [98]:
df['rating'].nunique()

5

In [99]:
df['user_id'].nunique()

944

In [100]:
df['movie_id'].nunique()

1682

In [101]:
#merging Dataframes

In [21]:
movie = pd.merge(df,df1, on='movie_id')
movie.head()

   user_id  movie_id  rating         ts             title
0        0        50       5  881250949  Star Wars (1977)
1      290        50       5  880473582  Star Wars (1977)
2       79        50       4  891271545  Star Wars (1977)
3        2        50       5  888552084  Star Wars (1977)
4        8        50       5  879362124  Star Wars (1977)

In [22]:
#remove the redundant of useless columns i.e. ts
movie.drop('ts',axis=1,inplace=True)

In [23]:
movie.head()

   user_id  movie_id  rating             title
0        0        50       5  Star Wars (1977)
1      290        50       5  Star Wars (1977)
2       79        50       4  Star Wars (1977)
3        2        50       5  Star Wars (1977)
4        8        50       5  Star Wars (1977)

In [24]:
movie.columns

Index(['user_id', 'movie_id', 'rating', 'title'], dtype='object')

In [25]:
#number of rating for each movie
movie['title'].value_counts().head(10)

Star Wars (1977)                 584
Contact (1997)                   509
Fargo (1996)                     508
Return of the Jedi (1983)        507
Liar Liar (1997)                 485
English Patient, The (1996)      481
Scream (1996)                    478
Toy Story (1995)                 452
Air Force One (1997)             431
Independence Day (ID4) (1996)    429
Name: title, dtype: int64

In [26]:
#find the average rating for each movie

In [27]:
rating = pd.DataFrame(movie.groupby('title')['rating'].mean().sort_values(ascending=False)).head(10)

In [28]:
rating

                                                   rating
title
They Made Me a Criminal (1939)                        5.0
Marlene Dietrich: Shadow and Light (1996)             5.0
Saint of Fort Washington, The (1993)                  5.0
Someone Else's America (1995)                         5.0
Star Kid (1997)                                       5.0
Great Day in Harlem, A (1994)                         5.0
Aiqing wansui (1994)                                  5.0
Santa with Muscles (1996)                             5.0
Prefontaine (1997)                                    5.0
Entertaining Angels: The Dorothy Day Story (1996)     5.0

In [29]:
rating['count'] = movie['title'].value_counts()

In [30]:
rating.head(20)

                                                   rating  count
title
They Made Me a Criminal (1939)                        5.0      1
Marlene Dietrich: Shadow and Light (1996)             5.0      1
Saint of Fort Washington, The (1993)                  5.0      2
Someone Else's America (1995)                         5.0      1
Star Kid (1997)                                       5.0      3
Great Day in Harlem, A (1994)                         5.0      1
Aiqing wansui (1994)                                  5.0      1
Santa with Muscles (1996)                             5.0      2
Prefontaine (1997)                                    5.0      3
Entertaining Angels: The Dorothy Day Story (1996)     5.0      1

In [31]:
rating.sort_values(by='count',ascending=False).head(10)

                                                   rating  count
title
Star Kid (1997)                                       5.0      3
Prefontaine (1997)                                    5.0      3
Saint of Fort Washington, The (1993)                  5.0      2
Santa with Muscles (1996)                             5.0      2
They Made Me a Criminal (1939)                        5.0      1
Marlene Dietrich: Shadow and Light (1996)             5.0      1
Someone Else's America (1995)                         5.0      1
Great Day in Harlem, A (1994)                         5.0      1
Aiqing wansui (1994)                                  5.0      1
Entertaining Angels: The Dorothy Day Story (1996)     5.0      1

In [32]:
movie_pivot = movie.pivot_table(index='user_id',columns='title',values='rating')
movie_pivot.head()

title,'Til There Was You (1997),1-900 (1994),101 Dalmatians (1996),12 Angry Men (1957),187 (1997),2 Days in the Valley (1996),"20,000 Leagues Under the Sea (1954)",2001: A Space Odyssey (1968),3 Ninjas: High Noon At Mega Mountain (1998),"39 Steps, The (1935)",...,Yankee Zulu (1994),Year of the Horse (1997),You So Crazy (1994),Young Frankenstein (1974),Young Guns (1988),Young Guns II (1990),"Young Poisoner's Handbook, The (1995)",Zeus and Roxanne (1997),unknown,Á köldum klaka (Cold Fever) (1994)
user_id,,,,,,,,,,,,,,,,,,,,,
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,2.0,5.0,NaN,NaN,3.0,4.0,NaN,NaN,...,NaN,NaN,NaN,5.0,3.0,NaN,NaN,NaN,4.0,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [35]:
movie_selected = 'Star Wars (1977)'

In [36]:
ms_rates = movie_pivot[movie_selected]
ms_rates.head()

user_id
0    5.0
1    5.0
2    5.0
3    NaN
4    5.0
Name: Star Wars (1977), dtype: float64

In [37]:
import warnings
warnings.filterwarnings('ignore')

In [38]:
corrs = movie_pivot.corrwith(ms_rates)
corrs.head(20)

title
'Til There Was You (1997)                      0.872872
1-900 (1994)                                  -0.645497
101 Dalmatians (1996)                          0.211132
12 Angry Men (1957)                            0.184289
187 (1997)                                     0.027398
2 Days in the Valley (1996)                    0.066654
20,000 Leagues Under the Sea (1954)            0.289768
2001: A Space Odyssey (1968)                   0.230884
3 Ninjas: High Noon At Mega Mountain (1998)         NaN
39 Steps, The (1935)                           0.106453
8 1/2 (1963)                                  -0.142977
8 Heads in a Duffel Bag (1997)                -0.577350
8 Seconds (1994)                              -0.755929
A Chef in Love (1996)                          0.868599
Above the Rim (1994)                          -0.645497
Absolute Power (1997)                          0.085440
Abyss, The (1989)                              0.203709
Ace Ventura: Pet Detective (1994)              0.062689
Ace Ventura: When Nature Calls (1995)          0.094514
Across the Sea of Time (1995)                 -0.132453
dtype: float64

In [39]:
corrs.sort_values(ascending=False).head(20)

title
Hollow Reed (1996)                                                                   1.0
Commandments (1997)                                                                  1.0
Cosi (1996)                                                                          1.0
No Escape (1994)                                                                     1.0
Stripes (1981)                                                                       1.0
Star Wars (1977)                                                                     1.0
Man of the Year (1995)                                                               1.0
Beans of Egypt, Maine, The (1994)                                                    1.0
Old Lady Who Walked in the Sea, The (Vieille qui marchait dans la mer, La) (1991)    1.0
Outlaw, The (1943)                                                                   1.0
Line King: Al Hirschfeld, The (1996)                                                 1.0
Hurricane Streets (1998)                                                             1.0
Scarlet Letter, The (1926)                                                           1.0
Good Man in Africa, A (1994)                                                         1.0
Safe Passage (1994)                                                                  1.0
Golden Earrings (1947)                                                               1.0
Full Speed (1996)                                                                    1.0
Twisted (1996)                                                                       1.0
Ed's Next Move (1996)                                                                1.0
Mondo (1996)                                                                         1.0
dtype: float64

In [40]:
corrs_df = pd.DataFrame(corrs, columns=['correlation'])
corrs_df.head()

                           correlation
title
'Til There Was You (1997)     0.872872
1-900 (1994)                 -0.645497
101 Dalmatians (1996)         0.211132
12 Angry Men (1957)           0.184289
187 (1997)                    0.027398

In [65]:
corrs_df['rating']= rating['rating']
corrs_df['count']=rating['count']

corrs_df.head()

corrs_df.head()

In [66]:
corrs_df.head()

                           correlation  rating  count
title
'Til There Was You (1997)     0.872872     NaN    NaN
1-900 (1994)                 -0.645497     NaN    NaN
101 Dalmatians (1996)         0.211132     NaN    NaN
12 Angry Men (1957)           0.184289     NaN    NaN
187 (1997)                    0.027398     NaN    NaN

In [68]:
corrs_df[corrs_df['count']>50].sort_values(
by='correlation',ascending=False).head(10)

Empty DataFrame
Columns: [correlation, rating, count]
Index: []

In [62]:
top_recom=list(corrs_df[corrs_df['count']>50].sort_values(
by='correlation',ascending=False).head(3).index)

In [1]:
top_recom.remove(movie_selected)

NameError: name 'top_recom' is not defined

In [ ]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

def movie_recommend(movie_selected = 'Star Wars (1977)'):
    #read files
    cols = ['user_id','movie_id','rating','ts']
    df = pd.read_csv('u.data',sep='\t',names=cols).drop('ts',axis=1)
    item_cols = ['movie_id','title']+ [str(i) for i in range(22)]
    df1 = pd.read_csv('u.item',sep='|', names = item_cols, encoding = "ISO-8859-1") [['movie_id','title']]

    #merge the DataFrames
    movie = pd.merge(df,df1, on='movie_id')

    #Create pivot table
    movie_pivot = movie.pivot_table(index='user_id',columns='title',values='rating')

    #Find Similarity For Selected Movie
    corrs = movie_pivot.corrwith(movie_pivot[movie_selected])
    corrs_df = pd.DataFrame(corrs, columns=['correlation'])
    corrs_df['rating']=movie.groupby('title')['rating'].mean()
    corrs_df['count'] = movie['title'].value_counts()

    #Find Top 2-3 recommendation
    top_recom=list(corrs_df[corrs_df['count']>50].sort_values(
    by='correlation',ascending=False).head(3).index)
    top_recom.remove(movie_selected)
    return top_recom